Revit 2024 API
LightGroup.AddLight Method
 Add a new light instance to the group
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void AddLight(
	ElementId lightId
)
Visual Basic
Public Sub AddLight ( _
	lightId As ElementId _
)
Visual C++
public:
void AddLight(
	ElementId^ lightId
)
Parameters
lightId
Type: Autodesk.Revit.DB.ElementId
 The ID of the light instance to add to the group
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given element ID does not correspond to a light instance -or- The light instance is in this LightGroup
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace